const fs = require('fs');
const chars = `我汝此其彼何或全 無在互己物人如之 処時故位術言字筆 書墨文論紙絵手
足心目口骨腹背光 闇木草火水風石金 花種果油大中小周 内外軸衣糸日月
星天地山上下左右 東西南北縦横始終 生入一二三四五六 七八九撃行来識
獣鳥魚虫龍機箱男 女皇神船兵弓車虎 馬巫将王為貝刀声 家善友美受与力
須而即御再乎於遠 悪真噫雪夏冬止激 付端律集亦値積国 同閉開春秋子混
倉官民迷連常笑戦 壊等毎静層極色季 銭名労助冠満族清 定錘赤菓硬牌軟
豊貧長傾圧鼓包机 散席深門認傷棚綿 普少輩黒反輪血覆 謝父琴白煙寒古
耳抗母米勿猫酒学 守十囲道奮急新蜜 前使体唯正樽遊甘 型歌裁怖質党片
件加別青嗅後歪広 万平百欽械立座麗 耒能咍犬直棉毛巻 躍壁㕮牛多網凹
増針翰享失思橋半 纂穐哇硫俐羅佰帽 呉醇必叫決引飛蟲 玄妙癒斥逆眉残`;

// loop over files in `glyphs/` directory
fs.readdirSync('glyphs').forEach(file => {
    if (file.endsWith('.svg')) {
        if (!chars.includes(file.charAt(0))) {
            fs.unlinkSync(`glyphs/${file}`);
        }
    }
});